In [8]:
import pandas as pd 
import numpy as np 

import matplotlib.pyplot as plt 
import seaborn as sns 
%matplotlib inline 

from sklearn.model_selection import train_test_split 
from sklearn.feature_selection import chi2
from sklearn.feature_selection import SelectKBest, SelectPercentile

In [6]:
data = pd.read_csv('D:/Python Code/Machine_Learning/Data/titanic_train.csv')
data.shape

(891, 12)

In [7]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
 # Sex or Gender, Pclass, Embarked is categorical variable 
# So we have to convert it categorical to number 
data['Sex'] = np.where(data.Sex == 'male', 1, 0)

# For Embarked
ordinal_label = {k: i for i, k in enumerate(data['Embarked'].unique(), 0)}
data['Embarked'] = data['Embarked'].map(ordinal_label)

d:\python code\env_files\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

In [30]:
data.Sex.head()

0    0
1    0
2    0
3    0
4    0
Name: Sex, dtype: int32

In [14]:
 # Seperate train, test set 
X_train, X_test, y_train, y_test = train_test_split(
    data[['Pclass', 'Sex', 'Embarked']],
    data['Survived'],
    test_size=.3,
    random_state=0) 
X_train.shape, X_test.shape

((623, 3), (268, 3))

In [19]:
X_train.fillna(0)

     Pclass  Sex  Embarked
857       1    0         0
52        1    0         1
386       3    0         0
124       1    0         0
578       3    0         1
..      ...  ...       ...
835       1    0         1
192       3    0         0
629       3    0         2
559       3    0         0
684       2    0         0

[623 rows x 3 columns]

In [21]:
# Calculate chi-square P value between each of the variable
# It returns two array. First one is for Fisher score, and second one is chi-square distribution to obtain the P value 

f_score = chi2(X_train, y_train)
f_score

(array([21.61080949,         nan, 11.83961845]),
 array([3.33964360e-06,            nan, 5.79837058e-04]))

In [22]:
pvalues = pd.Series(f_score[1])
pvalues.index = X_train.columns
pvalues.sort_values(ascending=False)

Embarked    0.000580
Pclass      0.000003
Sex              NaN
dtype: float64